'use strict';

/*
Теоретичні питання
1. Як можна оголосити змінну у Javascript?

Оголосити змінну - використовуючи ключове слово let або const, надавши ім'я (назву змінної) і вказавши значення даної змінної (для let є можливість не вказувати значення відразу, а визначити в подальшому коді, для const визначення значення є обов'язковим).
Назва змінної може починатись лише з літери або символів '$', '_'. Можуть в собі містити літери, цифри та символи '$'та '_', не можуть містити в собі пробіли. Змінні не мають містити в собі зарезервовані в ES слова.

2. Що таке рядок (string) і як його створити (перерахуйте всі можливі варіанти)?

string (рядок) - це послідовність символів огорнутих в одинарні, подвійні або зворотні лапки.
Створити string можна при ініціалізації змінної, огорнувши значення змінної в пару однакових лапок, також можна змінити тип данних змінної за допомогою метода toString().

3. Як перевірити тип даних змінної в JavaScript?

Перевірити тип даних змінної можна за допомогою оператора typeof.

4. Поясніть чому '1' + 1 = 11.

При додаванні рядка з числом оператор приєднання неявно приводить тип даних значення справа від себе до типу даних значення яке ліворуч, тому в даному випадку ми отримуємо конкатенацію двох рядків.
*/

//Практичні завдання
// 1. Оголосіть змінну і присвойте в неї число. Перевірте, чи ця змінна має тип "number" і виведіть результат в консоль.

const number = 5;

console.log(typeof number);

// 2. Оголосіть змінну name і присвойте їй ваше ім'я. Оголосіть змінну lastName і присвойте в неї Ваше прізвище.
// Виведіть повідомлення у консоль у форматі `Мене звати {ім'я}, {прізвище}` використовуючи ці змінні.

const name = 'Олексій';
const lastName = 'Шведов';

console.log(`Мене звати ${name} ${lastName}`);

// 3. Оголосіть змінну з числовим значенням і виведіть в консоль її значення всередині рядка.

const myAge = 43;

console.log(`Мені ${myAge} роки`);